viennipooh/woodhomme/sources/drivers/stm32eth_mac.c
#include "string.h"

#include "eth_mac.h"
#include "stm32eth_regs.h"



#define ETH_MAC_DRV_VERSION    DRIVER_VERSION_MAJOR_MINOR(2, 0) /* driver version */

/* Driver Version */
static const driver_version _driver_version = {
    ETH_MAC_API_VERSION,
    ETH_MAC_DRV_VERSION
};

/* Driver Capabilities */
static const eth_mac_capabilities _driver_capabilities = {
    1, /* 1 = IPv4 header checksum verified on receive */
    1, /* 1 = IPv6 checksum verification supported on receive */
    1, /* 1 = UDP payload checksum verified on receive */
    1, /* 1 = TCP payload checksum verified on receive */
    1, /* 1 = ICMP payload checksum verified on receive */
    1, /* 1 = IPv4 header checksum generated on transmit */
    1, /* 1 = IPv6 checksum generation supported on transmit */
    1, /* 1 = UDP payload checksum generated on transmit */
    1, /* 1 = TCP payload checksum generated on transmit */
    1, /* 1 = ICMP payload checksum generated on transmit */
    0, /* Ethernet Media Interface type */
    0, /* 1 = driver provides initial valid MAC address */
    0, /* 1 = callback event \ref ETH_MAC_EVENT_RX_FRAME generated */
    0, /* 1 = callback event \ref ETH_MAC_EVENT_TX_FRAME generated */
    0, /* 1 = wakeup event \ref ETH_MAC_EVENT_WAKEUP generated */
    0  /* 1 = Precision Timer supported */
};

static eth_mac_signalevent_t _mac_event = 0;

//
//  Registers
// 
/* Private macro -------------------------------------------------------------*/

#define MODE_IN  0
#define MODE_OUT 1
#define MODE_AF  2
#define MODE_AN  3

#define OTYPE_PP 0
#define OTYPE_OD 1

#define OSPEED_LS 0
#define OSPEED_MS 1
#define OSPEED_HS 2
#define OSPEED_VHS 3

#define PUPD_N   0
#define PUPD_PU  1
#define PUPD_PD  2
#define PUPD_RES 3

#define GPIO_INIT(GPIO,PIN,MODE,OTYPE,OSPEED,PUPD,AF,LOCK) \
do{\
    unsigned char pin=0;\
    unsigned char reg=0;\
  RCC->AHB1ENR |= RCC_AHB1ENR_##GPIO##EN;\
  GPIO->LCKR &= ~(1<<PIN);\
  \
  GPIO->MODER &= ~(3<<(PIN<<1));\
  GPIO->MODER |=  (MODE<<(PIN<<1));\
  \
  GPIO->OTYPER &= ~(1<<PIN);\
  GPIO->OTYPER |=  (OTYPE<<PIN);\
  \
  GPIO->OSPEEDR &= ~(3<<(PIN<<1));\
  GPIO->OSPEEDR |=  (OSPEED<<(PIN<<1));\
  \
  GPIO->PUPDR &= ~(3<<(PIN<<1));\
  GPIO->PUPDR |=  (PUPD<<(PIN<<1));\
  \
  if( (pin=PIN,pin)>7 )\
  {pin-=8;reg=1;}\
  GPIO->AFR[reg] &=  ~(0xF<<(pin<<2));\
  GPIO->AFR[reg] |=   ((0xF&(AF))<<(pin<<2));\
  \
  GPIO->LCKR |= (LOCK<<PIN);\
}while(0);

/**
 * @brief Ethernet descriptors and buffers size
 */
#define ETHERNET_DESCRIPTOR_RECEIVE_COUNT       4
#define ETHERNET_DESCRIPTOR_TRANSMIT_COUNT      4

#define ETHERNET_PACKET_SIZE                    1522



/**
 * @brief Ethernet callback
 */
//static eth_phy_callback eth_phy_cb = 0;

/**
 * @brief Ethernet descriptors
 */
static volatile ethernet_descriptor_t descriptor_receive[ETHERNET_DESCRIPTOR_RECEIVE_COUNT];
static volatile ethernet_descriptor_t descriptor_transmit[ETHERNET_DESCRIPTOR_TRANSMIT_COUNT];
static volatile ethernet_descriptor_t *descriptor_receive_p = descriptor_receive;
static volatile ethernet_descriptor_t *descriptor_transmit_p = descriptor_transmit;

/**
 * @brief Ethernet buffers receive_buffer and transmit_bufer
 */
static uint8_t receive_buffer[ETHERNET_DESCRIPTOR_RECEIVE_COUNT][ETHERNET_PACKET_SIZE];
static uint8_t transmit_bufer[ETHERNET_DESCRIPTOR_TRANSMIT_COUNT][ETHERNET_PACKET_SIZE];
//const uint8_t transmit_buffer_test[] = {
//  0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,
//  0x01,0x02,0x03,0x04,0x05,0x06,
//  0x00,64,
//  0x01,0x02,0x03,0x04,0x05,0x06,0x07,0x08,0x09,0x0A,0x0B,0x0C,0x0D,0x0E,0x0F,0x10,0x11,0x12,
//  0x00,0x00,0x03,0x00
//};

//
//  Functions
//
static int eth_mac_init_rcc()
{
  RCC->AHB1ENR |= RCC_AHB1ENR_GPIOAEN | 
                  RCC_AHB1ENR_GPIOBEN | 
                  RCC_AHB1ENR_GPIOCEN |
                  RCC_AHB1ENR_GPIOEEN |
                  RCC_AHB1ENR_GPIOGEN;
  
  RCC->AHB1RSTR |= RCC_AHB1RSTR_ETHMACRST;
  RCC->AHB1RSTR &= ~RCC_AHB1RSTR_ETHMACRST;
  
  RCC->AHB1ENR |= RCC_AHB1ENR_GPIOAEN |
                  RCC_AHB1ENR_GPIOBEN |
                  RCC_AHB1ENR_GPIOCEN |
                  RCC_AHB1ENR_GPIOGEN |
                  RCC_AHB1ENR_GPIOEEN;
  RCC->AHB1ENR  |= RCC_AHB1ENR_ETHMACEN | RCC_AHB1ENR_ETHMACTXEN | RCC_AHB1ENR_ETHMACRXEN;
  return 0;
}

static int eth_mac_deinit_rcc()
{
  RCC->AHB1ENR |= RCC_AHB1ENR_GPIOAEN | 
                  RCC_AHB1ENR_GPIOBEN | 
                  RCC_AHB1ENR_GPIOCEN;
  
  RCC->AHB1RSTR |= RCC_AHB1RSTR_ETHMACRST;
  RCC->AHB1RSTR &= ~RCC_AHB1RSTR_ETHMACRST;
  
  RCC->AHB1ENR  |= RCC_AHB1ENR_GPIOAEN | RCC_AHB1ENR_GPIOBEN | RCC_AHB1ENR_GPIOCEN | RCC_AHB1ENR_GPIOGEN | RCC_AHB1ENR_GPIOEEN;
  RCC->AHB1ENR  |= RCC_AHB1ENR_ETHMACEN | RCC_AHB1ENR_ETHMACTXEN | RCC_AHB1ENR_ETHMACRXEN;
  return 0;
}

#include "extio.h"
static int eth_mac_init_gpio( void )
{  
  /**
   * GPIO init
   *
   */
#ifdef LQFP_144
  GPIO_INIT(GPIOA, 0,MODE_AF,OTYPE_PP,OSPEED_VHS,PUPD_N,11,0); // MII_CRS
  GPIO_INIT(GPIOA, 3,MODE_AF,OTYPE_PP,OSPEED_VHS,PUPD_N,11,0); // MII_COL
  GPIO_INIT(GPIOA, 7,MODE_AF,OTYPE_PP,OSPEED_VHS,PUPD_N,11,0); // MII_RX_DV
  
  GPIO_INIT(GPIOA, 1,MODE_AF,OTYPE_PP,OSPEED_VHS,PUPD_N,11,0); // MII_RXCLK
  GPIO_INIT(GPIOC, 4,MODE_AF,OTYPE_PP,OSPEED_VHS,PUPD_N,11,0); // MII_RXD0
  GPIO_INIT(GPIOC, 5,MODE_AF,OTYPE_PP,OSPEED_VHS,PUPD_N,11,0); // MII_RXD1
  GPIO_INIT(GPIOB, 0,MODE_AF,OTYPE_PP,OSPEED_VHS,PUPD_N,11,0); // MII_RXD2
  GPIO_INIT(GPIOB, 1,MODE_AF,OTYPE_PP,OSPEED_VHS,PUPD_N,11,0); // MII_RXD3
  
  GPIO_INIT(GPIOC, 3,MODE_AF,OTYPE_PP,OSPEED_VHS,PUPD_N,11,0); // MII_TXCLK
  GPIO_INIT(GPIOG,13,MODE_AF,OTYPE_PP,OSPEED_VHS,PUPD_N,11,0); // MII_TXD0
  GPIO_INIT(GPIOB,13,MODE_AF,OTYPE_PP,OSPEED_VHS,PUPD_N,11,0); // MII_TXD1
  GPIO_INIT(GPIOC, 2,MODE_AF,OTYPE_PP,OSPEED_VHS,PUPD_N,11,0); // MII_TXD2
  GPIO_INIT(GPIOE, 2,MODE_AF,OTYPE_PP,OSPEED_VHS,PUPD_N,11,0); // MII_TXD3
  
  GPIO_INIT(GPIOB,11,MODE_AF,OTYPE_PP,OSPEED_VHS,PUPD_N,11,0); // MII_TXen
  
#endif
#ifdef LQFP_100
  GPIO_INIT(GPIOA, 0,MODE_AF,OTYPE_PP,OSPEED_VHS,PUPD_N,11,0); // MII_CRS
  GPIO_INIT(GPIOA, 3,MODE_AF,OTYPE_PP,OSPEED_VHS,PUPD_N,11,0); // MII_COL
  GPIO_INIT(GPIOA, 7,MODE_AF,OTYPE_PP,OSPEED_VHS,PUPD_N,11,0); // MII_RX_DV
 #if ((UTD_M != 0) || (IIP != 0))
  GPIO_INIT(GPIOB,10,MODE_AF,OTYPE_PP,OSPEED_VHS,PUPD_N,11,0); // MII_RX_ER
 #endif
  GPIO_INIT(GPIOA, 1,MODE_AF,OTYPE_PP,OSPEED_VHS,PUPD_N,11,0); // MII_RXCLK
  GPIO_INIT(GPIOC, 4,MODE_AF,OTYPE_PP,OSPEED_VHS,PUPD_N,11,0); // MII_RXD0
  GPIO_INIT(GPIOC, 5,MODE_AF,OTYPE_PP,OSPEED_VHS,PUPD_N,11,0); // MII_RXD1
  GPIO_INIT(GPIOB, 0,MODE_AF,OTYPE_PP,OSPEED_VHS,PUPD_N,11,0); // MII_RXD2
  GPIO_INIT(GPIOB, 1,MODE_AF,OTYPE_PP,OSPEED_VHS,PUPD_N,11,0); // MII_RXD3
  
