viennipooh/woodhomme/sources/drivers/stm32eth_mac.c
  GPIO_INIT(GPIOC, 3,MODE_AF,OTYPE_PP,OSPEED_VHS,PUPD_N,11,0); // MII_TXCLK
  GPIO_INIT(GPIOB,12,MODE_AF,OTYPE_PP,OSPEED_VHS,PUPD_N,11,0); // MII_TXD0
  GPIO_INIT(GPIOB,13,MODE_AF,OTYPE_PP,OSPEED_VHS,PUPD_N,11,0); // MII_TXD1
  GPIO_INIT(GPIOC, 2,MODE_AF,OTYPE_PP,OSPEED_VHS,PUPD_N,11,0); // MII_TXD2
  GPIO_INIT(GPIOE, 2,MODE_AF,OTYPE_PP,OSPEED_VHS,PUPD_N,11,0); // MII_TXD3
  
  GPIO_INIT(GPIOB,11,MODE_AF,OTYPE_PP,OSPEED_VHS,PUPD_N,11,0); // MII_TXen
  
 #if ((UTD_M != 0) || (IIP != 0))
  GPIO_INIT(GPIOA, 8, MODE_AF, OTYPE_PP, OSPEED_VHS, PUPD_N,  0, 0); // CLKIN
  RCC_MCO1Config(RCC_MCO1Source_HSE, RCC_MCO1Div_1);
 #endif
#endif
  return 0;
}

static int eth_mac_deinit_gpio( void )
{
  /**
   * GPIO deinit
   */
  GPIO_INIT(GPIOA, 0,MODE_IN,OTYPE_PP,OSPEED_VHS,PUPD_N,11,0);
  GPIO_INIT(GPIOA, 1,MODE_IN,OTYPE_PP,OSPEED_VHS,PUPD_N,11,0);
  GPIO_INIT(GPIOA, 3,MODE_IN,OTYPE_PP,OSPEED_VHS,PUPD_N,11,0);
  GPIO_INIT(GPIOA, 7,MODE_IN,OTYPE_PP,OSPEED_VHS,PUPD_N,11,0);
  GPIO_INIT(GPIOB, 0,MODE_IN,OTYPE_PP,OSPEED_VHS,PUPD_N,11,0);
  GPIO_INIT(GPIOB, 1,MODE_IN,OTYPE_PP,OSPEED_VHS,PUPD_N,11,0);
  GPIO_INIT(GPIOB, 8,MODE_IN,OTYPE_PP,OSPEED_VHS,PUPD_N,11,0);
  GPIO_INIT(GPIOB,10,MODE_IN,OTYPE_PP,OSPEED_VHS,PUPD_N,11,0);
  GPIO_INIT(GPIOB,11,MODE_IN,OTYPE_PP,OSPEED_VHS,PUPD_N,11,0);
  GPIO_INIT(GPIOB,12,MODE_IN,OTYPE_PP,OSPEED_VHS,PUPD_N,11,0);
  GPIO_INIT(GPIOB,13,MODE_IN,OTYPE_PP,OSPEED_VHS,PUPD_N,11,0);
  GPIO_INIT(GPIOC, 2,MODE_IN,OTYPE_PP,OSPEED_VHS,PUPD_N,11,0);
  GPIO_INIT(GPIOC, 3,MODE_IN,OTYPE_PP,OSPEED_VHS,PUPD_N,11,0);
  GPIO_INIT(GPIOC, 4,MODE_IN,OTYPE_PP,OSPEED_VHS,PUPD_N,11,0);
  GPIO_INIT(GPIOC, 5,MODE_IN,OTYPE_PP,OSPEED_VHS,PUPD_N,11,0);
  return 0;
}


static int eth_mac_init_desc()
{
  uint32_t index = 0;
  
  for( index = 0 ; index < ETHERNET_DESCRIPTOR_TRANSMIT_COUNT ; index++ )
  {
    descriptor_transmit[index].status                    = DESCRIPTOR_TRANSMIT_STATUS_CTRL_TCH | DESCRIPTOR_TRANSMIT_STATUS_CTRL_IC;
    
    //if(_driver_capabilities->checksum_offload_tx_ip4)
    {
        descriptor_transmit[index].status |= DESCRIPTOR_TRANSMIT_STATUS_CTRL_CIC_ALL_HARDWARE;
    }
    descriptor_transmit[index].buffer_count              = ((/*ETHERNET_PACKET_SIZE*/0 & 0x00001FFF) << 16) | ((ETHERNET_PACKET_SIZE & 0x00001FFF) << 0);
    descriptor_transmit[index].buffer_address            = (uint32_t)transmit_bufer[index];
    
    if(index == ETHERNET_DESCRIPTOR_TRANSMIT_COUNT - 1)
    {
      descriptor_transmit[index].buffer_next_address       = (uint32_t)&descriptor_transmit[0];
      descriptor_transmit[index].status                 |= DESCRIPTOR_TRANSMIT_STATUS_CTRL_TER;
    }
    else
    {
      descriptor_transmit[index].buffer_next_address       = (uint32_t)&descriptor_transmit[index+1];
    }
#if defined(ETHERNET_DESCRIPTOR_EXTENDED) && ETHERNET_DESCRIPTOR_EXTENDED == 1
    descriptor_transmit[index].status_extended           = 0;
    descriptor_transmit[index].reserved1                 = 0;
    descriptor_transmit[index].time_stamp_low            = 0;
    descriptor_transmit[index].time_stamp_high           = 0;
#endif
  }
  
  for( index = 0 ; index < ETHERNET_DESCRIPTOR_RECEIVE_COUNT ; index++ )
  {
    descriptor_receive[index].status                    = DESCRIPTOR_RECEIVE_STATUS_OWN;
    descriptor_receive[index].status                    |= DESCRIPTOR_RECEIVE_STATUS_FT;
    descriptor_receive[index].status                    |= DESCRIPTOR_RECEIVE_STATUS_IPHCE_TSV;
    descriptor_receive[index].status                    |= DESCRIPTOR_RECEIVE_STATUS_PCE_ESA;
    descriptor_receive[index].buffer_count              = DESCRIPTOR_BUFFER_COUNT_RCH | ((/*ETHERNET_PACKET_SIZE*/0 & 0x00001FFF) << 16) | ((ETHERNET_PACKET_SIZE & 0x00001FFF) << 0);
      
    if(index == ETHERNET_DESCRIPTOR_RECEIVE_COUNT - 1)
    {
      //descriptor_receive[index].buffer_count              = DESCRIPTOR_BUFFER_COUNT_RCH/* | DESCRIPTOR_BUFFER_COUNT_RER | */((/*ETHERNET_PACKET_SIZE*/0 & 0x00001FFF) << 16) | ((ETHERNET_PACKET_SIZE & 0x00001FFF) << 0);
      descriptor_receive[index].buffer_next_address       = (uint32_t)&descriptor_receive[0];
    }
    else
    {
      descriptor_receive[index].buffer_next_address       = (uint32_t)&descriptor_receive[index+1];
    }
    descriptor_receive[index].buffer_address            = (uint32_t)receive_buffer[index];
#if defined(ETHERNET_DESCRIPTOR_EXTENDED) && ETHERNET_DESCRIPTOR_EXTENDED == 1
    descriptor_receive[index].status_extended           = 0;
    descriptor_receive[index].reserved1                 = 0;
    descriptor_receive[index].time_stamp_low            = 0;
    descriptor_receive[index].time_stamp_high           = 0;
#endif
  }
  
//  for( index = 0 ; index <= sizeof(transmit_buffer_test); index++ )
//  {
//    transmit_bufer[0][index] = transmit_buffer_test[index];
//    transmit_bufer[1][index] = transmit_buffer_test[index];
//    transmit_bufer[2][index] = transmit_buffer_test[index];
//    transmit_bufer[3][index] = transmit_buffer_test[index];
//    transmit_bufer[4][index] = transmit_buffer_test[index];
//    
//  }
//  descriptor_transmit[0].buffer_count = sizeof(transmit_buffer_test);
//  descriptor_transmit[0].status |= DESCRIPTOR_TRANSMIT_STATUS_CTRL_FS | DESCRIPTOR_TRANSMIT_STATUS_CTRL_LS;
//  //descriptor_transmit[0].status |= DESCRIPTOR_TRANSMIT_STATUS_OWN;
//  
//  descriptor_transmit[1].buffer_count = sizeof(transmit_buffer_test);
//  descriptor_transmit[1].status |= DESCRIPTOR_TRANSMIT_STATUS_CTRL_FS | DESCRIPTOR_TRANSMIT_STATUS_CTRL_LS;
//  //descriptor_transmit[1].status |= DESCRIPTOR_TRANSMIT_STATUS_OWN;
//
//  descriptor_transmit[2].buffer_count = sizeof(transmit_buffer_test);
//  descriptor_transmit[2].status |= DESCRIPTOR_TRANSMIT_STATUS_CTRL_FS | DESCRIPTOR_TRANSMIT_STATUS_CTRL_LS;
//  //descriptor_transmit[2].status |= DESCRIPTOR_TRANSMIT_STATUS_OWN;
//
//  descriptor_transmit[3].buffer_count = sizeof(transmit_buffer_test);
//  descriptor_transmit[3].status |= DESCRIPTOR_TRANSMIT_STATUS_CTRL_FS | DESCRIPTOR_TRANSMIT_STATUS_CTRL_LS;
//  //descriptor_transmit[3].status |= DESCRIPTOR_TRANSMIT_STATUS_OWN;
//
//  descriptor_transmit[4].buffer_count = sizeof(transmit_buffer_test);
//  descriptor_transmit[4].status |= DESCRIPTOR_TRANSMIT_STATUS_CTRL_FS | DESCRIPTOR_TRANSMIT_STATUS_CTRL_LS;
//  //descriptor_transmit[4].status |= DESCRIPTOR_TRANSMIT_STATUS_OWN;

//    
///* Bit definition for Ethernet DMA Interrupt Enable Register */
//#define ETH_DMAIER_NISE      ((uint32_t)0x00010000)  /* Normal interrupt summary enable */
//#define ETH_DMAIER_AISE      ((uint32_t)0x00008000)  /* Abnormal interrupt summary enable */
//#define ETH_DMAIER_ERIE      ((uint32_t)0x00004000)  /* Early receive interrupt enable */
//#define ETH_DMAIER_FBEIE     ((uint32_t)0x00002000)  /* Fatal bus error interrupt enable */
//#define ETH_DMAIER_ETIE      ((uint32_t)0x00000400)  /* Early transmit interrupt enable */
//#define ETH_DMAIER_RWTIE     ((uint32_t)0x00000200)  /* Receive watchdog timeout interrupt enable */
//#define ETH_DMAIER_RPSIE     ((uint32_t)0x00000100)  /* Receive process stopped interrupt enable */
//#define ETH_DMAIER_RBUIE     ((uint32_t)0x00000080)  /* Receive buffer unavailable interrupt enable */
//#define ETH_DMAIER_RIE       ((uint32_t)0x00000040)  /* Receive interrupt enable */
//#define ETH_DMAIER_TUIE      ((uint32_t)0x00000020)  /* Transmit Underflow interrupt enable */
//#define ETH_DMAIER_ROIE      ((uint32_t)0x00000010)  /* Receive Overflow interrupt enable */
//#define ETH_DMAIER_TJTIE     ((uint32_t)0x00000008)  /* Transmit jabber timeout interrupt enable */
//#define ETH_DMAIER_TBUIE     ((uint32_t)0x00000004)  /* Transmit buffer unavailable interrupt enable */
//#define ETH_DMAIER_TPSIE     ((uint32_t)0x00000002)  /* Transmit process stopped interrupt enable */
//#define ETH_DMAIER_TIE       ((uint32_t)0x00000001)  /* Transmit interrupt enable */
  return 0;
}

