viennipooh/woodhomme/sources/drivers/stm32eth_mac.c
static int eth_mac_deinit_desc()
{
  return 0;
}

#ifdef LQFP_144
  #define ETH_MACMIIAR_CR_Div ETH_MACMIIAR_CR_Div102;
#endif
#ifdef LQFP_100
  #define ETH_MACMIIAR_CR_Div ETH_MACMIIAR_CR_Div62;
#endif


extern void __reboot__();
static int eth_mac_init_regs()
{
   
  /**
   * ETHERNET init
   */
  //
  RCC_ClocksTypeDef RCC_Clocks;

  RCC_GetClocksFreq(&RCC_Clocks);
  //Задать ETH->MACMIIAR в соответствии с частотой
  
  ETH->MACMIIAR = ETH_MACMIIAR_CR_Div;
  
  ETH->MACCR    = ETH_MACCR_IPCO | ETH_MACCR_FES | ETH_MACCR_IFG_64Bit; //LQFP100 = ETH_MACCR_IFG_96Bit
  ETH->MACFFR   = ETH_MACFFR_RA | ETH_MACFFR_PCF_ForwardPassedAddrFilter | ETH_MACFFR_PAM;
  
  // !!! //Переключение в дуплекс
  ETH->MACCR   |= ETH_MACCR_DM;
  // !!!
  
  ETH->DMARDLAR = (uint32_t)descriptor_receive;
  ETH->DMATDLAR = (uint32_t)descriptor_transmit;
  ETH->MACA0LR  = 0x12345678;
  ETH->MACA0HR  = 0x00000330;
  
  
    /* Enable transmit state machine of the MAC for transmission on the MII */  
  ETH->MACCR   |= ETH_MACCR_TE;//ETH_MACTransmissionCmd(ENABLE);
  /* Flush Transmit FIFO */
  ETH->DMAOMR  |= ETH_DMAOMR_FTF | ETH_DMAOMR_TSF; // ETH_FlushTransmitFIFO();
#if ((UTD_M != 0) || (IIP != 0))
  volatile int cCount = 0;
  while (ETH->DMAOMR & ETH_DMAOMR_FTF) { // Wait Elush End
    if (++cCount >= 10000) {
      for (cCount = 0; cCount < 1000000; ++cCount) { }
      __reboot__();
    }
  }
#else
  while (ETH->DMAOMR & ETH_DMAOMR_FTF) { } // Wait Elush End
#endif

  /* Enable receive state machine of the MAC for reception from the MII */  
  ETH->MACCR |= ETH_MACCR_RE;  //ETH_MACReceptionCmd(ENABLE);
 
  /* Start DMA transmission */
  ETH->DMAOMR |= ETH_DMAOMR_ST; //ETH_DMATransmissionCmd(ENABLE); 
  /* Start DMA reception */
  ETH->DMAOMR |= ETH_DMAOMR_SR; //ETH_DMAReceptionCmd(ENABLE);  

  ETH->DMABMR   = ETH_DMABMR_USP | ETH_DMABMR_RDP_1Beat | ETH_DMABMR_PBL_32Beat; //LQFP100 = <Нет>
  
  //ETH->DMAOMR   = ETH_DMAOMR_SR | ETH_DMAOMR_ST;
  
//  (void)ETH->DMABMR;
//  ETH->DMABMR   = ETH_DMABMR_SR;
//  ETH->DMABMR   = ETH_DMABMR_USP | ETH_DMABMR_RDP_4xPBL_32Beat | ETH_DMABMR_PBL_4xPBL_32Beat | ETH_DMABMR_RTPR_1_1;
//  ETH->DMAIER   = ETH_DMAIER_NISE | ETH_DMAIER_TIE | ETH_DMAIER_RIE;
//  
//  ETH->DMARDLAR = (uint32_t)descriptor_receive;
//  ETH->DMATDLAR = (uint32_t)descriptor_transmit;
//  
//  ETH->DMARPDR  = (uint32_t)descriptor_receive;
//  ETH->DMATPDR = (uint32_t)descriptor_transmit;
//  
//  ETH->MACA0LR  = 0x12345678;
//  ETH->MACA0HR  = 0x00000030;
//  
//  ETH->MACCR    = ETH_MACCR_TE | ETH_MACCR_RE | ETH_MACCR_FES | ETH_MACCR_DM | ETH_MACCR_IFG_64Bit | ETH_MACCR_BL_1;
//  
//  ETH->DMAOMR   = ETH_DMAOMR_SR;
//  ETH->DMAOMR  |= ETH_DMAOMR_ST;
//  
  
  ETH->DMAIER = ETH_DMAIER_NISE/* | ETH_DMAIER_AISE*/;
  ETH->DMAIER |= ETH_DMAIER_RIE | ETH_DMAIER_TIE;
  
  NVIC->IP[((uint32_t)(int32_t)ETH_IRQn)]               = (uint8_t)(((1<<__NVIC_PRIO_BITS) - 1 << (8U - __NVIC_PRIO_BITS)) & (uint32_t)0xFFUL);
  //NVIC_SetPriority (ETH_IRQn, (1<<__NVIC_PRIO_BITS) - 1);  /* set Priority for Systick Interrupt */
  NVIC->ISER[(((uint32_t)(int32_t)ETH_IRQn) >> 5UL)] = (uint32_t)(1UL << (((uint32_t)(int32_t)ETH_IRQn) & 0x1FUL));
  //NVIC_EnableIRQ(ETH_IRQn);
  
  return 0;
}

static int eth_mac_deinit_regs()
{
  NVIC->ICER[(((uint32_t)(int32_t)ETH_IRQn) >> 5UL)] = (uint32_t)(1UL << (((uint32_t)(int32_t)ETH_IRQn) & 0x1FUL));
  ETH->DMAIER &= ~(ETH_DMAIER_NISE | ETH_DMAIER_RIE | ETH_DMAIER_TIE);
  return 0;
}


static driver_version eth_mac_get_version(void)
{
  return _driver_version;
}

static eth_mac_capabilities eth_mac_get_capabilities(void)
{
  return _driver_capabilities;
}

#if ((UTD_M != 0) || (IIP != 0))
static int32_t eth_mac_phy_write(uint8_t phy_addr, uint8_t reg_addr, uint16_t data);
static void eth_mac_init_phy() {
  //
  volatile int i;
  for (i = 0; i < 200000; ++i) { }
  GPIOC->BSRRH = GPIO_Pin_9; //Сброс PHY - начало
  
  GPIO_INIT(GPIOC, 9, MODE_OUT, OTYPE_PP, OSPEED_VHS, PUPD_N, 11, 0); // RESET_PHYLAN
  
  GPIO_INIT(GPIOB,10,MODE_OUT,OTYPE_PP,OSPEED_VHS,PUPD_N,11,0); // PHYAD0   0
  GPIO_INIT(GPIOA, 1,MODE_OUT,OTYPE_PP,OSPEED_VHS,PUPD_N,11,0); // PHYAD1   0
  GPIO_INIT(GPIOB, 1,MODE_OUT,OTYPE_PP,OSPEED_VHS,PUPD_N,11,0); // PHYAD2   0
  
  GPIO_INIT(GPIOC, 4,MODE_OUT,OTYPE_PP,OSPEED_VHS,PUPD_N,11,0); // MODE0    0
  GPIO_INIT(GPIOC, 5,MODE_OUT,OTYPE_PP,OSPEED_VHS,PUPD_N,11,0); // MODE1    0
  GPIO_INIT(GPIOA, 3,MODE_OUT,OTYPE_PP,OSPEED_VHS,PUPD_N,11,0); // MODE2    0
  
  GPIO_INIT(GPIOB, 0,MODE_OUT,OTYPE_PP,OSPEED_VHS,PUPD_N,11,0); // RMIISEL  0
  
  GPIOB->BSRRH = GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_10; // 000 000 0
  GPIOA->BSRRH = GPIO_Pin_1;
  GPIOA->BSRRL = GPIO_Pin_3;
  GPIOC->BSRRL = GPIO_Pin_4 | GPIO_Pin_5;

  for (i = 0; i <  50000; ++i) { }
  GPIOC->BSRRL = GPIO_Pin_9; //Сброс PHY - конец

  GPIO_INIT(GPIOC, 1, MODE_AF, OTYPE_PP, OSPEED_VHS, PUPD_N, 11, 0); // MDC
  GPIO_INIT(GPIOA, 2, MODE_AF, OTYPE_PP, OSPEED_VHS, PUPD_N, 11, 0); // MDIO
  for (i = 0; i <  10000; ++i) { }
  
  ETH->MACMIIAR = ETH_MACMIIAR_CR_Div;

//  int32_t cRes;
//  cRes = eth_mac_phy_write(0, 0, 0x8000);
//  cRes = eth_mac_phy_write(0, 0, 0x3300);
  
}
uint8_t aRegIndexes[] = { 0, 1, 2, 3, 4, 5, 6, 17, 18, 26, 27, 29, 30, 31 };
uint16_t aRegValues[sizeof(aRegIndexes)];

static int32_t eth_mac_phy_read(uint8_t phy_addr, uint8_t reg_addr, uint16_t *data);
void eth_mac_phy_read_regs() {
  for (int i = 0; i < sizeof(aRegIndexes); ++i) {
    eth_mac_phy_read(0, aRegIndexes[i], &aRegValues[i]);
  }
}
#endif

static int32_t eth_mac_initialize(eth_mac_signalevent_t cb_event)
{
  eth_mac_init_rcc();
#if ((UTD_M != 0) || (IIP != 0))
  eth_mac_init_desc();
  eth_mac_init_phy();
  eth_mac_init_gpio();
#else
  eth_mac_init_gpio();
  eth_mac_init_desc();
#endif
  eth_mac_init_regs();
  
  _mac_event = cb_event;
  
  return DRIVER_OK;
}

static int32_t eth_mac_uninitialize(void)
{
  eth_mac_deinit_rcc();
  eth_mac_deinit_gpio();
  eth_mac_deinit_desc();
  eth_mac_deinit_regs();
  
  _mac_event = 0;
  
  return DRIVER_OK;
}

static int32_t eth_mac_power_control(power_state state)
{
  switch (state)
  {
    case POWER_OFF:
      {
      }
      break;
    case POWER_LOW:
      {
      }
      break;
    case POWER_FULL:
      {
      }
      break;
    default:
      return DRIVER_ERROR_UNSUPPORTED;
  }
  return DRIVER_OK;
}

static int32_t eth_mac_get_mac_address(eth_mac_addr *ptr_addr)
{
  if(ptr_addr)
  {
    ptr_addr->b[5] = (uint8_t)((ETH->MACA0HR >> 8 ) & 0xFF);
    ptr_addr->b[4] = (uint8_t)((ETH->MACA0HR >> 0 ) & 0xFF);
    ptr_addr->b[3] = (uint8_t)((ETH->MACA0LR >> 24) & 0xFF);
    ptr_addr->b[2] = (uint8_t)((ETH->MACA0LR >> 16) & 0xFF);
    ptr_addr->b[1] = (uint8_t)((ETH->MACA0LR >> 8 ) & 0xFF);
    ptr_addr->b[0] = (uint8_t)((ETH->MACA0LR >> 0 ) & 0xFF);
  } else return DRIVER_ERROR_PARAMETER;
  return DRIVER_OK;
}

static int32_t eth_mac_set_mac_address(const eth_mac_addr *ptr_addr)
{
  if(ptr_addr)
  {
    ETH->MACA0HR = ((((uint32_t)(ptr_addr->b[5])) << 8) | ((uint32_t)(ptr_addr->b[4])));
    ETH->MACA0LR = ((((uint32_t)(ptr_addr->b[3])) << 24) | (((uint32_t)(ptr_addr->b[2])) << 16) | (((uint32_t)(ptr_addr->b[1])) << 8) | (((uint32_t)(ptr_addr->b[0])) << 0));
  } else return DRIVER_ERROR_PARAMETER;
  return DRIVER_OK;
}

