viennipooh/woodhomme/sources/drivers/stm32eth_mac.c
static int32_t eth_mac_set_address_filter(const eth_mac_addr *ptr_addr, uint32_t num_addr)
{
  return DRIVER_ERROR_UNSUPPORTED;
}

#include "info.h"
#ifdef USE_STP
  #include "stp.h"
#else
  #include "ethernet.h"
#endif
#include "portmacro.h"
#include "def.h"
extern void vTaskDelay( portTickType xTicksToDelay );

uint32_t gArpTxCount0 = 0, gArpTxCount1 = 0;

static int32_t eth_mac_send_frame(const uint8_t *frame, uint32_t len, uint32_t flags)
{
  struct eth_hdr* ethhdr = (struct eth_hdr *)frame;
  if((frame) && !(descriptor_transmit_p->status & DESCRIPTOR_TRANSMIT_STATUS_OWN))
  {
    memcpy((void*)(descriptor_transmit_p->buffer_address),frame,len);
    descriptor_transmit_p->buffer_count = len & DESCRIPTOR_BUFFER_COUNT_TBS1;
    descriptor_transmit_p->status |= DESCRIPTOR_TRANSMIT_STATUS_CTRL_FS | DESCRIPTOR_TRANSMIT_STATUS_CTRL_LS;
#if (ENABLE_TAIL_TAG)
    if (IsTailTag(0)) {
      descriptor_transmit_p->status |= DESCRIPTOR_TRANSMIT_STATUS_CTRL_DP;
    }
#endif
    descriptor_transmit_p->status |= DESCRIPTOR_TRANSMIT_STATUS_CTRL_CIC_ALL_HARDWARE;
    //descriptor_transmit_p->status |= DESCRIPTOR_TRANSMIT_STATUS_CTRL_IC;
    descriptor_transmit_p->status |= DESCRIPTOR_TRANSMIT_STATUS_OWN;
    descriptor_transmit_p = (ethernet_descriptor_t*)(descriptor_transmit_p->buffer_next_address);

     /* When Tx Buffer unavailable flag is set: clear it and resume transmission */
    if (ETH->DMASR & ETH_DMASR_TBUS)
    {
      if (ethhdr->type == PP_HTONS(ETHTYPE_ARP)) { //0x0608
        ++gArpTxCount0;
      }
      /* Clear TBUS ETHERNET DMA flag */
      ETH->DMASR = ETH_DMASR_TBUS;
      /* Resume DMA transmission*/
      ETH->DMATPDR = 0;
    } else {
      vTaskDelay(1);
      if (ETH->DMASR & ETH_DMASR_TBUS)
      {
        if (ethhdr->type == PP_HTONS(ETHTYPE_ARP)) { //0x0608
          ++gArpTxCount1;
        }
        /* Clear TBUS ETHERNET DMA flag */
        ETH->DMASR = ETH_DMASR_TBUS;
        /* Resume DMA transmission*/
        ETH->DMATPDR = 0;
      } else {
        vTaskDelay(1);
        if (ETH->DMASR & ETH_DMASR_TBUS)
        {
          /* Clear TBUS ETHERNET DMA flag */
          ETH->DMASR = ETH_DMASR_TBUS;
          /* Resume DMA transmission*/
          ETH->DMATPDR = 0;
        } else {
          return DRIVER_ERROR_PARAMETER;
        }
      }
    }
  } else {
    return DRIVER_ERROR_PARAMETER;
  }
  return DRIVER_OK;
}
static int32_t eth_mac_read_frame(uint8_t *frame, uint32_t len)
{
  if((frame) && !(descriptor_receive_p->status & DESCRIPTOR_RECEIVE_STATUS_OWN))
  {
    memcpy(frame,(void*)(descriptor_receive_p->buffer_address),len);
    descriptor_receive_p->status = DESCRIPTOR_RECEIVE_STATUS_OWN;
//    descriptor_receive_p->status                    = DESCRIPTOR_RECEIVE_STATUS_OWN;
//    descriptor_receive_p->status                    |= DESCRIPTOR_RECEIVE_STATUS_FT;
//    descriptor_receive_p->status                    |= DESCRIPTOR_RECEIVE_STATUS_IPHCE_TSV;
//    descriptor_receive_p->status                    |= DESCRIPTOR_RECEIVE_STATUS_PCE_ESA;
//    descriptor_receive_p->buffer_count              = DESCRIPTOR_BUFFER_COUNT_RCH | ((/*ETHERNET_PACKET_SIZE*/0 & 0x00001FFF) << 16) | ((ETHERNET_PACKET_SIZE & 0x00001FFF) << 0);
//      
    descriptor_receive_p = (ethernet_descriptor_t*)(descriptor_receive_p->buffer_next_address);
  } else return DRIVER_ERROR_PARAMETER;
  
  return DRIVER_OK;
}

static uint32_t eth_mac_get_rx_frame_size(void)
{
  uint32_t len = 0;
  if(!(descriptor_receive_p->status & DESCRIPTOR_RECEIVE_STATUS_OWN))
  {
    len = ((descriptor_receive_p->status & DESCRIPTOR_RECEIVE_STATUS_FL) >> 16);
  }
  return len;
}

static int32_t eth_mac_get_rx_frame_time(eth_mac_time *time)
{
  return DRIVER_ERROR_UNSUPPORTED;
}

static int32_t eth_mac_get_tx_frame_time(eth_mac_time *time)
{
  return DRIVER_ERROR_UNSUPPORTED;
}

static int32_t eth_mac_control(uint32_t control, uint32_t arg)
{
  switch (control)
  {
    case ETH_MAC_CONFIGURE:
      {
        switch (arg & ETH_MAC_SPEED_Msk)
        {
          case ETH_MAC_SPEED_10M:
            {
              ETH->MACCR &= ~ETH_MACCR_FES;
            }
            break;
          case ETH_SPEED_100M:
            {
              ETH->MACCR |= ETH_MACCR_FES;
            }
            break;
          default:
            return DRIVER_ERROR_UNSUPPORTED;
        }

        switch (arg & ETH_MAC_DUPLEX_Msk)
        {
          case ETH_MAC_DUPLEX_HALF:
            {
              ETH->MACCR &= ~ETH_MACCR_DM;
            }
            break;
          case ETH_MAC_DUPLEX_FULL:
            {
              ETH->MACCR |= ETH_MACCR_DM;
            }
            break;
          default:
            return DRIVER_ERROR_UNSUPPORTED;
        }

        if (arg & ETH_MAC_LOOPBACK)
        {
          ETH->MACCR |= ETH_MACCR_LM;
        }
        else
        {
          ETH->MACFFR &=~ETH_MACCR_LM;
        }

        if ((arg & ETH_MAC_CHECKSUM_OFFLOAD_RX) ||
            (arg & ETH_MAC_CHECKSUM_OFFLOAD_TX))
        {
          return DRIVER_ERROR_UNSUPPORTED;
        }

        if (!(arg & ETH_MAC_ADDRESS_BROADCAST))
        {
          ETH->MACFFR |= ETH_MACFFR_BFD;
        }
        else
        {
          ETH->MACFFR &=~ETH_MACFFR_BFD;
        }

        if (arg & ETH_MAC_ADDRESS_MULTICAST)
        {
          ETH->MACFFR |= ETH_MACFFR_PAM;
        }
        else
        {
          ETH->MACFFR &=~ETH_MACFFR_PAM;
        }

        if (arg & ETH_MAC_ADDRESS_ALL)
        {
          ETH->MACFFR |= ETH_MACFFR_RA;
        }
        else
        {
          ETH->MACFFR &=~ETH_MACFFR_RA;
        }
      }
      break;

    case ETH_MAC_CONTROL_TX:
      {
        switch (arg)
        {
          case 0:
            {
              ETH->MACCR &=~ETH_MACCR_TE;
            }
            break;
          case 1:
            {
              ETH->MACCR |= ETH_MACCR_TE;
            }
            break;
          default:
            return DRIVER_ERROR_UNSUPPORTED;
        }
      }
      break;

    case ETH_MAC_CONTROL_RX:
      {
        switch (arg)
        {
          case 0:
            {
              ETH->MACCR &=~ETH_MACCR_RE;
            }
            break;
          case 1:
            {
              ETH->MACCR |= ETH_MACCR_RE;
            }
            break;
          default:
            return DRIVER_ERROR_UNSUPPORTED;
        }
      }
      break;

    case ETH_MAC_FLUSH:
      {
        if (arg & ETH_MAC_FLUSH_RX)
        {
          // flush rx buffer
          return DRIVER_ERROR_UNSUPPORTED;
        }
        if (arg & ETH_MAC_FLUSH_TX)
        {
          // flush tx buffer
          return DRIVER_ERROR_UNSUPPORTED;
        }
      }
      break;

    case ETH_MAC_SLEEP:
      {
        return DRIVER_ERROR_UNSUPPORTED;
      }
      break;

    case ETH_MAC_VLAN_FILTER:
      {
        return DRIVER_ERROR_UNSUPPORTED;
      }
      break;

    default:
      return DRIVER_ERROR_UNSUPPORTED;
  }
  return DRIVER_OK;
}

static int32_t eth_mac_control_timer(uint32_t control, eth_mac_time *time)
{
  return DRIVER_ERROR_UNSUPPORTED;
}

