viennipooh/woodhomme/sources/drivers/stm32eth_mac.c
static int32_t eth_mac_phy_read(uint8_t phy_addr, uint8_t reg_addr, uint16_t *data)
{
  ETH->MACMIIAR &= ~(ETH_MACMIIAR_MR | ETH_MACMIIAR_PA | ETH_MACMIIAR_MB | ETH_MACMIIAR_MW);
  ETH->MACMIIAR |= (phy_addr << 11) & ETH_MACMIIAR_PA;
  ETH->MACMIIAR |= (reg_addr << 6)  & ETH_MACMIIAR_MR;
  ETH->MACMIIAR |= ETH_MACMIIAR_MB; // read start
  
  if(data)
  {
    do {}
    while(ETH->MACMIIAR & ETH_MACMIIAR_MB > 0); // wait for read
    *data = ETH->MACMIIDR; // read data
  }
  else return DRIVER_ERROR_PARAMETER;
  
  return DRIVER_OK;
}

static int32_t eth_mac_phy_write(uint8_t phy_addr, uint8_t reg_addr, uint16_t data)
{
  ETH->MACMIIAR &= ~(ETH_MACMIIAR_MR | ETH_MACMIIAR_PA | ETH_MACMIIAR_MB | ETH_MACMIIAR_MW);
  ETH->MACMIIAR |= (phy_addr << 11) & ETH_MACMIIAR_PA;
  ETH->MACMIIAR |= (reg_addr << 6)  & ETH_MACMIIAR_MR;
  ETH->MACMIIDR = data; // write data
  ETH->MACMIIAR |= ETH_MACMIIAR_MW | ETH_MACMIIAR_MB; // write start
  
  if(data)
  {
    do {}
    while(ETH->MACMIIAR & ETH_MACMIIAR_MB > 0); // wait for write
  }
  else return DRIVER_ERROR_PARAMETER;
  return DRIVER_OK;
}

// End ETH MAC Interface

eth_mac ETH_MAC_(0) =
{
    eth_mac_get_version,
    eth_mac_get_capabilities,
    eth_mac_initialize,
    eth_mac_uninitialize,
    eth_mac_power_control,
    eth_mac_get_mac_address,
    eth_mac_set_mac_address,
    eth_mac_set_address_filter,
    eth_mac_send_frame,
    eth_mac_read_frame,
    eth_mac_get_rx_frame_size,
    eth_mac_get_rx_frame_time,
    eth_mac_get_tx_frame_time,
    eth_mac_control_timer,
    eth_mac_control,
    eth_mac_phy_read,
    eth_mac_phy_write
};



void ETH_WKUP_IRQHandler( void )
{
  uint32_t status;
  status = ETH->DMASR;
  if(status & ETH_MACSR_PMTS)
  {
    if(_mac_event)
      _mac_event(ETH_MAC_EVENT_WAKEUP);
    (void)ETH->MACPMTCSR;
  }
}

/**
 * @brief Ethernet interrupt handler
 *
 */
static uint32_t ETH_IRQHandler_stat = 0;
void ETH_IRQHandler( void )
{
  uint32_t status;
  status = ETH->DMASR;
  ETH_IRQHandler_stat++;
  /**
   * @brief ethernet interrupt handler
   */
  //if(status & ETH_DMASR_NIS)
  {
    if(status & ETH_DMASR_TS)
    {
      ETH->DMASR = ETH_DMASR_TS;
      //if(status & ETH_DMASR_TPS)
      {
        if(_mac_event)
          _mac_event(ETH_MAC_EVENT_TX_FRAME);
      }
    }
    if(status & ETH_DMASR_RS)
    {
      ETH->DMASR = ETH_DMASR_RS;
      ETH->DMAIER &= ~ETH_DMAIER_RIE;
      //if(status & ETH_DMASR_RPS)
      {
        if(_mac_event)
          _mac_event(ETH_MAC_EVENT_RX_FRAME);
        if(0){
          ethernet_descriptor_t *temp;
          {
            temp = (ethernet_descriptor_t *)ETH->DMACHRDR;            
            if(!(temp->status & DESCRIPTOR_RECEIVE_STATUS_OWN))
            {
              temp->buffer_count              = DESCRIPTOR_BUFFER_COUNT_RCH | ((/*ETHERNET_PACKET_SIZE*/0 & 0x00001FFF) << 16) | ((ETHERNET_PACKET_SIZE & 0x00001FFF) << 0);
              temp->status                    = DESCRIPTOR_RECEIVE_STATUS_OWN;
            }
          }
        }
        
      }
      ETH->DMAIER |= ETH_DMAIER_RIE;
    }
    /**
     * @brief reset interrupt
     */
    ETH->DMASR = ETH_DMASR_NIS;
  }
  
  /**
   * @brief ethernet interrupt handler
   */
  if(status & ETH_DMASR_AIS)
  {
    /**
     * @brief reset interrupt
     */
    status |= ETH_DMASR_AIS;
  }
}
